In [21]:
import os
import requests
import pandas as pd
import duckdb

## SHOW TABLES

In [75]:
#creates DB if does not exist, else use to test table names created

sql_query = '''
show tables
'''

with duckdb.connect('data/person_of_influence.db') as con:
    display(con.sql(sql_query).df())

Empty DataFrame
Columns: [name]
Index: []

## POI STAGE

In [63]:

sql_query = '''
select * from poi_stage limit 100
'''

with duckdb.connect('data/person_of_influence.db') as con:
    display(con.sql(sql_query).df())

            name  num_cats  bst_cat_rnk     bst_cat         dt
0        50 Cent         1          142       Actor 2025-03-22
1     A$AP Rocky         1          479       Actor 2025-03-22
2    A. J. Brown         1          166         NFL 2025-03-22
3      AJ Dillon         1          281         NFL 2025-03-22
4     AJ Griffin         1          452         NBA 2025-03-22
..           ...       ...          ...         ...        ...
95     Ali Biçim         1          361  Influencer 2025-03-22
96  Ali Khamenei         1          193  Politician 2025-03-22
97    Alia Bhatt         1          432       Actor 2025-03-22
98     Alice Guo         1          159  Politician 2025-03-22
99  Alice Weidel         1          420  Politician 2025-03-22

[100 rows x 5 columns]

In [64]:
sql_query = '''
describe poi_stage
'''

with duckdb.connect('data/person_of_influence.db') as con:
    display(con.sql(sql_query).df())

   column_name column_type null   key default extra
0         name     VARCHAR  YES  None    None  None
1     num_cats      BIGINT  YES  None    None  None
2  bst_cat_rnk      BIGINT  YES  None    None  None
3      bst_cat     VARCHAR  YES  None    None  None
4           dt        DATE  YES  None    None  None

## POI HIST

In [66]:

sql_query = '''
select
    dt,
    count(*) as num_rows
from poi_hist
group by dt
order by dt
'''

with duckdb.connect('data/person_of_influence.db') as con:
    display(con.sql(sql_query).df())

          dt  num_rows
0 2025-03-22      2688

## DELETE/DROP/RESET

In [74]:
sql_query = '''
drop table poi_test
'''

with duckdb.connect('data/person_of_influence.db') as con:
    con.sql(sql_query)